API/GetFlight_API/Log/vtd_user.log

2025-05-12 21:09:22,748 [1] INFO  - Loaded appender: FileAppenderInternal
2025-05-12 21:09:22,756 [1] INFO  - Loaded appender: FileAppenderExternal
2025-05-12 21:09:22,756 [1] INFO  - Loaded appender: UserLoggerAppender
2025-05-12 21:09:22,757 [1] INFO  - Loaded appender: FileAppenderInternal
2025-05-12 21:09:22,757 [1] INFO  - Loaded appender: FileAppenderExternal
2025-05-12 21:09:22,757 [1] INFO  - Loaded appender: UserLoggerAppender
2025-05-12 21:09:23,066 [9] INFO  - Step 'Start' : Step 'Start' started
2025-05-12 21:09:23,123 [9] INFO  - Step 'Start' ended successfully
2025-05-12 21:09:23,127 [9] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2025-05-12 21:09:23,129 [9] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2025-05-12 21:09:23,132 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2025-05-12 21:09:23,142 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Los Angeles</ArrivalCity>
      <FlightDate>2025-12-31T00:00:00+00:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2025-05-12 21:09:23,158 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2025-05-12 21:09:23,234 [9] INFO  - Returning the response to the previous channel
2025-05-12 21:09:23,238 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>11:06 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:09 AM</DepartureTime>
          <FlightNumber>2880</FlightNumber>
          <Price>134.8</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>02:43 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>01:45 PM</DepartureTime>
          <FlightNumber>3019</FlightNumber>
          <Price>124</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>07:31 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>06:33 PM</DepartureTime>
          <FlightNumber>3740</FlightNumber>
          <Price>126.8</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>03:55 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>02:57 PM</DepartureTime>
          <FlightNumber>4661</FlightNumber>
          <Price>107.2</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>12:18 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>11:21 AM</DepartureTime>
          <FlightNumber>4777</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>01:31 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:33 PM</DepartureTime>
          <FlightNumber>6142</FlightNumber>
          <Price>121.2</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>01:30 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:10 AM</DepartureTime>
          <FlightNumber>6305</FlightNumber>
          <Price>295</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>02:50 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>11:30 AM</DepartureTime>
          <FlightNumber>6306</FlightNumber>
          <Price>255</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>05:00 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>01:00 PM</DepartureTime>
          <FlightNumber>6307</FlightNumber>
          <Price>245</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>06:00 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:00 PM</DepartureTime>
          <FlightNumber>6308</FlightNumber>
          <Price>230</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>10:30 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>07:00 PM</DepartureTime>
          <FlightNumber>6309</FlightNumber>
          <Price>199</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>05:07 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>04:09 PM</DepartureTime>
          <FlightNumber>7574</FlightNumber>
          <Price>136</Price>
        </Flight>
        <Flight>
          <Airline>TWA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>08:42 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>07:45 AM</DepartureTime>
          <FlightNumber>8649</FlightNumber>
          <Price>134.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2025-05-12 21:09:23,263 [9] INFO  - Structural Validation: True
2025-05-12 21:09:23,276 [9] INFO  - Checkpoint 3: "2880" >= "1" passed
2025-05-12 21:09:23,279 [9] INFO  - Step 'GetFlights' ended successfully
2025-05-12 21:09:23,282 [9] INFO  - Step 'Iteration 1' ended successfully
2025-05-12 21:09:23,284 [9] INFO  - Step 'Test Flow' ended successfully
2025-05-12 21:09:23,286 [9] INFO  - Step 'End' : Step 'End' started
2025-05-12 21:09:23,294 [9] INFO  - Step 'End' ended successfully
